Repository: farzinsh7/hanse
Catalog: about/locale/*/LC_MESSAGES/django.po
Languages: de

source: About
de: Over

source: Home
de: Thuis

source: Message From CEO
de: Bericht van CEO

source: Company Overview
de: Bedrijfsoverzicht

source: Monday - Friday, 09:00 - 17:00.
de: Maandag - Vrijdag, 09:00 - 17:00.

source: Contact Us
de: Neem contact met ons op

source: Sign up for email alerts
de: Meld u aan voor e-mailwaarschuwingen

source: Stay current with our latest insights
de: Blijf op de hoogte van onze nieuwste inzichten

source: Enter Email Here
de: Voer hier uw e-mailadres in

source: Submit
de: Indienen

source: Copyright
de: auteursrechten

source: Designed by
de: Ontworpen door

source: Monday
de: Maandag

source: Friday
de: Vrijdag

source: Business lines
de: Zakelijke lijnen

source: Trading Line
de: Handelslijn

source: Investment Line
de: Investeringslijn
